//1. Є змінна х, якій ви надаєте довільне числове значення.
//    Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'.
//    Перевірте  скрипт при a, що
//    дорівнює 1, 0, -3

let arr_x=[1,0,-3]

console.log(arr_x)

for (const el of arr_x)
    {
        if (el === 0)
        {
            console.log("Вірно")
        }
        else
        {
            console.log("Невірно")
        }

    }

// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті
// години попадає число
// (в першу, другу, третю или четверту частину години).

let num = +prompt("Введіть число від 0 до 59")

  if (  num > 0 && num < 15 )
    {
        console.log("Число належить першій чверті")
    }
    else if ( num > 15 && num < 30 )
    {
        console.log("Число належить другій чверті")
    }
    else if ( num > 30 && num < 45 )
    {
        console.log("Число належить третій чверті")
    }
    else if ( num > 45 && num <= 60 )
    {
        console.log("Число належить четвертій чверті")
    }
    else
    {
        console.log("Ви ввели не число або число поза визначеним діапазоном")
    }

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця
// потрапляє це число (у першу, другу чи третю).

let day_num = +prompt("Введіть день місяця від 1 до 31")

    if (  day_num > 0 && day_num < 10 )
    {
        console.log("Число належить першій декаді")
    }
    else if ( day_num > 10 && day_num < 20 )
    {
        console.log("Число належить другій декаді")
    }
    else if ( day_num > 20 && day_num <=31  )
    {
        console.log("Число належить третій декаді")
    }
    else
    {
        console.log("Ви ввели не число або число поза визначеним діапазоном")
    }

    // - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня
// тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву
// дня англійською).

let day_of_week = prompt("Введіть день тижня від 1 до 5 (Пон -1 , Вів -2 , Сер -3 ,Чт -4 , Пт -5")
    switch (day_of_week)
    {
        case "1" : console.log("Monday")
            break;
        case "2" : console.log("Tuesday")
            break;
        case "3" : console.log("Wensday")
            break;
        case "4" : console.log("Thurthday")
            break;
        case "5" : console.log("Friday")
            break;
        default :  console.log("Ви ввели не число або число поза визначеним діапазоном")
    }

    //- Користувач вводить або має два числа.
// Потрібно знайти та вивести максимальне число з тих двох .
// Також потрібно врахувати коли введені рівні числа.

let in_num_1 = +prompt("Введіть перше число :")
let in_num_2 = +prompt("Введіть друге число :")

    if (in_num_1 === in_num_2)
        {
            console.log("Ви ввели одинакові числа")
        }
    else if ( in_num_1 > in_num_2)
        {
            console.log("Число :",in_num_1," більше за число :",in_num_2)
        }
    else if ( in_num_2 > in_num_1)
        {
            console.log("Число :",in_num_2," більше за число :",in_num_1)
        }
    else
        {
            console.log("Ви ввели не число")
        }

    // є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно).
// Напишіть код який,
// за допомоги  оператора || буде присвоювати змінній х значення "default"
// якщо значення змінної х являється falsy (хибноподыбне, тобто кастується до false)

let x= !!prompt("Введіть дані") || "default"